fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс 

Функция РассчитатьЗначение(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ДоговорыКонтрагентов.Ссылка КАК ДоговорыКонтрагентов,
	//|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	//|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	//|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Обслуживание,
	//|	НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.Дата, МЕСЯЦ) КАК Начало,
	//|	КОНЕЦПЕРИОДА(ВКМ_ОбслуживаниеКлиента.Дата, МЕСЯЦ) КАК Конец
	//|ПОМЕСТИТЬ ВТ_СозданныеОбслуживания
	//|ИЗ
	//|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	//|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ОбслуживаниеКлиента.Договор
	//|ГДЕ
	//|	ДоговорыКонтрагентов.ВидДоговора = &АбоненскоеОбслуживание
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_СозданныеОбслуживания.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
	//|	ВТ_СозданныеОбслуживания.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	//|	ВТ_СозданныеОбслуживания.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	//|	ВТ_СозданныеОбслуживания.Обслуживание КАК Обслуживание,
	//|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	//|	РеализацияТоваровУслуг.Дата КАК ДатаРеализации
	//|ПОМЕСТИТЬ ВТ_СозданныеРеализации
	//|ИЗ
	//|	ВТ_СозданныеОбслуживания КАК ВТ_СозданныеОбслуживания
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|		ПО ВТ_СозданныеОбслуживания.ДоговорыКонтрагентов = РеализацияТоваровУслуг.Договор
	//|			И (РеализацияТоваровУслуг.Дата МЕЖДУ ВТ_СозданныеОбслуживания.Начало И ВТ_СозданныеОбслуживания.Конец)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВТ_СозданныеРеализации.Реализация КАК Реализация,
	//|	ВТ_СозданныеРеализации.ДатаРеализации КАК ДатаРеализации
	//|ИЗ
	//|	ВТ_СозданныеРеализации КАК ВТ_СозданныеРеализации
	//|ГДЕ
	//|	ВТ_СозданныеРеализации.Реализация ЕСТЬ НЕ NULL 
	//|	И ВТ_СозданныеРеализации.ДатаРеализации МЕЖДУ &ДатаНачала И &ДатаОкончания
	//|	И ВТ_СозданныеРеализации.Реализация.Договор = &Договор";
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК ВКМ_НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ВКМ_ОкончаниеДействияДоговора,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговораАбоненскоеОбслуживание
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &ДатаНачала
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ВидДоговораАбоненскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СсылкиНаОбъекты = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДок.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
			НовыйДок.Договор = ВыборкаДетальныеЗаписи.Договор;
			НовыйДок.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			НовыйДок.Организация = ВыборкаДетальныеЗаписи.Организация;
			НовыйДок.ВыполнитьАвтозаполнение(НовыйДок.Услуги);
			НовыйДок.Комментарий = "Создан обработкой Массовое создание актов";
			Попытка
				//Если Не НовыйДок.ПроверитьЗаполнение() Тогда
				//	Продолжить;
				//КонецЕсли;
				НовыйДок.Записать();
				НовыйДокСсылка = НовыйДок.Ссылка;
				////
				//НовыйДокОбъект.Заполнить(
				////
				ДоговорУникальныйИдент = Строка(ВыборкаДетальныеЗаписи.Договор.УникальныйИдентификатор());
				РеализацияУникальныйИдент = Строка(НовыйДокСсылка.УникальныйИдентификатор());
				
				ДанныеДляТабЧасти = Новый Структура;
				ДанныеДляТабЧасти.Вставить("Договор", ДоговорУникальныйИдент);
				ДанныеДляТабЧасти.Вставить("Реализация", РеализацияУникальныйИдент);
				
				СсылкиНаОбъекты.Добавить(ДанныеДляТабЧасти);
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗаписатьЗначениеJSON(СсылкиНаОбъекты);
	
КонецФункции

#КонецОбласти
